(function() {
    'use strict';

    var AhoCorasick = function(keywords) {
        this._buildTables(keywords);
    };

    AhoCorasick.prototype._buildTables = function(keywords) {
        var gotoFn = {
            0: {}
        };
        var output = {};

        var state = 0;
        keywords.forEach(function(word) {
            var curr = 0;
            for (var i=0; i<word.length; i++) {
                var l = word[i];
                if (gotoFn[curr] && l in gotoFn[curr]) {
                    curr = gotoFn[curr][l];
                }
                else {
                    state++;
                    gotoFn[curr][l] = state;
                    gotoFn[state] = {};
                    curr = state;
                    output[state] = [];
                }
            }

            output[state].push(word);
        });

        var failure = {};
        var xs = [];

        // f(s) = 0 for all states of depth 1 (the ones just from which 0 can directly transition)
        for (var l in gotoFn[0]) {
            var state = gotoFn[0][l];
            failure[state] = 0;
            xs.push(state);
        }

        while (xs.length) {
            var r = xs.shift();
            // for each symbol a such that g(r, a) = s
            for (var l in gotoFn[r]) {
                var s = gotoFn[r][l];
                xs.push(s);

                // set state = f(r)
                var state = failure[r];
                while(state > 0 && !(l in gotoFn[state])) {
                    state = failure[state];
                }

                if (l in gotoFn[state]) {
                    var fs = gotoFn[state][l];
                    failure[s] = fs;
                    output[s] = output[s].concat(output[fs]);
                }
                else {
                    failure[s] = 0;
                }
            }
        }

        this.gotoFn = gotoFn;
        this.output = output;
        this.failure = failure;
    };

    AhoCorasick.prototype.search = function(string) {
        var state = 0;
        var results = [];
        for (var i=0; i<string.length; i++) {
            var l = string[i];
            while (state > 0 && !(l in this.gotoFn[state])) {
                state = this.failure[state];
            }
            if (!(l in this.gotoFn[state])) {
                continue;
            }

            state = this.gotoFn[state][l];

            if (this.output[state].length) {
                var foundStrs = this.output[state];
                results.push([i, foundStrs]);
            }
        }

        return results;
    };

    if (typeof module !== 'undefined') {
        module.exports = AhoCorasick;
    }
    else {
        window.AhoCorasick = AhoCorasick;
    }
})();

foulTree = new AhoCorasick( [ "пезд", "ебет", "хуй", "бляд", "пизд", "жоп", "хуя", "хуи", "хуе", "вздрач", "пизж", "высра", "хрен", "хер", "говн", "выеб", "трах", "ссать", "фуфл", "уеб", "дроч", "дрюч", "въеб", "сран", "заеб", "ебан", "пичуж", "ебит", "драч", "ебать", "ебаш", "мозгоеб", "ебал", "залуп", "мудох", "пендр", "сикат", "засра", "ебен", "испраж", "курв", "минет", "мудил", "наеб", "насас", "насосал", "отсас", "отсос", "отъеб", "педерас", "мудох", "ебех", "ебур", "хуюж", "сноша", "засер", "пендюр", "козли", "высер", "анал", "анус", "армячок", "архамудия", "афедрон", "ахунехо", "ахухунехо", "барать", "бардач", "бднуть", "бдун", "бдыкать", "бдюх", "бедка", "безмуд", "бессекельн", "бзде", "бзди", "бикса", "бля", "борделен", "бублить", "бульда", "бульза", "буфер", "варзуха", "вафлер", "вафлист", "взъебнуть", "взъебка", "взъебщик", "взятьзамягкоеместо", "влындить", "всекелить", "всекелиться", "всекелять", "всекеляться", "въябывать", "выеть", "вымавдошиваться", "высекелять", "высикивать", "выснашивать", "выссереть", "выссывать", "выхари", "глиномес", "гандон", "гниломудый", "говенный", "голощелка", "гомик", "гомосек", "гондон", "гузноеб", "гузнотер", "гумозник", "давалка", "даваха", "двуснастный", "девство", "дерьмовый", "дерьмоед", "дерьмо", "дилдо", "добиздоболить", "додик", "доебешить", "доебыва", "доеныйбык", "дойки", "долбаная", "долбежка", "долбоеб", "долданье", "долдать", "долдаться", "доппаешница", "досасывать", "досасыва", "досеколи", "досикивать", "досирать", "доснашива", "дососа", "досра", "доссыва", "доусеру", "доусрачки", "дрисня", "дристать", "дристун", "дрына", "дуплиться", "дуроеб", "ебака", "ебаришко", "ебатория", "ебачь", "ебельница", "ебивашумать", "ебистика", "ебистос", "ебись", "ебическаясила", "еблематика", "ебле", "ебливщин", "еблив", "ебломщелка", "ебло", "еблысь", "ебля", "еблясперископом", "ебляспляской", "ебнуть", "ебнуться", "ебня", "ебота", "еботина", "еботня", "ебство", "ебти", "ебукентий", "ебун", "ебутвашу", "ебучийкозел", "едрен", "едрижтвоювбабушку", "едритвоюзаногу", "едритвоюмать", "едрить", "едритявкорень", "елдак", "елда", "елдыкать", "елдыкнуть", "есик", "етиегомать", "етиихмать", "етися", "ебарь", "ебвашумать", "ебкая", "ебнутый", "живоглотка", "жиреха", "жирнозадый", "жмокнуть", "жмура", "жося", "журлить", "журло", "журня", "жучиться", "забабаха", "забздеть", "заглот", "задастый", "задниц", "задрипа", "взад", "закакать", "закакаться", "закакивать", "закакиваться", "заколупать", "заколупаться", "закосоебывать", "закосоебываться", "залазить", "залудить", "замондить", "замудить", "замудиться", "запердеть", "запридух", "запузырить", "засадить", "засаживать", "засандалить", "засеколить", "засеколиться", "засигарить", "засикивать", "засикиваться", "засирать", "засираться", "заснашивать", "заснашиваться", "засопливеть", "засосать", "засосаться", "засос", "зассывать", "зассываться", "зассыкать", "зассыха", "затруха", "затрухивать", "захачивать", "зашпандорить", "зашпундоривать", "здительный", "здюмо", "злоебучий", "зозуля", "зоофил", "зудить", "измудить", "измутызгать", "изнасиловани", "изнасилова", "изобразитьдевулю", "иссасывать", "иссасываться", "иссеколиться", "исснашивать", "исснашиваться", "иссосаный", "иссосать", "иссосаться", "йух", "какаруш", "какать", "какашка", "кастрат", "кедренефене", "кедренойбабушке", "кедренойматери", "кифирить", "кишкоправ", "клитор", "кнахт", "кобелить", "коблуха", "ковырялка", "кодеш", "кокушки", "коноебица", "кривоссачка", "кривоссыкалка", "крикуша", "куна", "кунка", "кустотерапия", "кутак", "лахудра", "леткаенка", "леф", "лохматка", "лынди", "лыха", "лэк", "люэс", "лярва", "малофейк", "малофь", "маркота", "марух", "марушк", "маслобой", "маслобойщик", "мастевый", "мастурбатор", "матьееперемать", "матьперемать", "матьтвоюедри", "матьтвоюети", "матьтвоюрастак", "матюг", "матюк", "махалка", "менжа", "менжеваться", "мессалина", "минжа", "многостаночни", "моргалик", "мотовило", "мотылек", "мохнатка", "мохнорылый", "мочиться", "мудак", "мудашвили", "муде", "мудик", "мудистый", "мудить", "муднюразве", "мудня", "мудоеб", "мудозвон", "мудотяп", "мудофер", "мудофлутия", "мудошлеп", "мудянка", "мудяшн", "набзде", "надриста", "нажариват", "накакат", "накакивать", "накласть", "намудить", "насаживат", "насеколит", "насирать", "наспаться", "насрать", "нассывать", "насунуть", "натяг", "нафиг", "нахариус", "наябывать", "невстаниха", "неебет", "неебущ", "несри", "нессы", "нифига", "нищеебство", "обдрист", "обиженк", "облиз", "обмочить", "обмудить", "обосрать", "обоссан", "обоссывать", "обписать", "обсасыва", "обсемен", "обсерать", "обсереть", "обсирать", "обснашивать", "обсосаться", "обспуск", "обссывать", "обхезать", "объеб", "объебщик", "объебыва", "огулять", "однодыроч", "одноместо", "оебнуть", "оебывать", "олюра", "опездол", "опорожня", "опущенн", "оргия", "осеколить", "оскоплен", "остоебеть", "отбарать", "отдаваться", "отдупли", "отжари", "отзудить", "отливальня", "отмондить", "отмудить", "отодра", "оторва", "отосрать", "отпяли", "отсеколит", "отсеривать", "отсикивать", "отсира", "отснаши", "отсрать", "отссывать", "отфачить", "отхарит", "отхарнть", "отшампурить", "отшворить", "отьебнуться", "охобачивать", "охочдобаб", "падалец", "падла", "падлюка", "пазель", "паскуд", "педермот", "педик", "педрил", "пежить", "пенис", "перде", "пердун", "пердяч", "перебздеть", "переебнуть", "переебывать", "перемондить", "перемудить", "перепихивать", "перепихнуть", "пересасывать", "пересасываться", "пересеколиться", "пересикива", "пересикну", "пересира", "пересоса", "пересра", "перессыва", "перещупа", "пердну", "пидор", "пилиться", "пиписк", "пипк", "письк", "писюл", "пихание", "плева", "плоскозадая", "побарать", "поблуди", "поддавать", "подзаборница", "подзалететь", "подмахива", "подмахну", "подмыва", "подосрать", "подосраться", "подпуститьсытности", "подранивать", "подристывать", "подсеколиться", "подсердечник", "подсирать", "подссывать", "подъеб", "подъебыва", "подъябыва", "поебист", "поебон", "поеть", "поебочка", "поебывать", "пожарить", "пожариться", "позитура", "пойтинафиг", "покакать", "помет", "помочиться", "помудить", "понос", "попердеть", "попердыва", "пописа", "попиха", "порево", "порочная", "портитьдух", "порчик", "посасывать", "посеривать", "поскребышь", "послаться", "поснашивать", "посрать", "потаскун", "потаскуха", "похезать", "похотник", "похоть", "похую", "поц", "пошмариться", "поябывать", "приебистый", "приебывать", "приебываться", "примавдовывать", "присеколиться", "присирать", "присрать", "приссывать", "продолбанн", "проебывать", "промудить", "просеколить", "просикивать", "просирать", "проснашивать", "просрать", "проссыва", "проститут", "проституц", "профура", "профурсетка", "пукать", "пульвер", "пуститьматюком", "путана", "путляха", "пыря", "пялит", "размавдюлива", "разосра", "разъеба", "расперемать", "распроеби", "распроеть", "распроеб", "рассекол", "рассерет", "рассирать", "рассывать", "растакая", "растак", "растуды", "растудыттвоютуды", "рехем", "розюлядь", "санжировать", "сафизм", "северок", "секельноемасло", "секель", "сексапил", "сексот", "семяизвержение", "серево", "серька", "сестроеб", "сика", "сикель", "сикля", "сикулет", "сикулек", "сикуха", "сикушка", "сиповка", "сип", "сиськ", "сисяст", "сифа", "сифил", "скоблить", "скосоебы", "случка", "смудить", "сношение", "совокупи", "совокупл", "соитие", "солоп", "сосюру", "спаривать", "сперма", "сприебом", "спускнуть", "срака", "срамная", "срать", "срачка", "срач", "ссак", "ссань", "ссачка", "ссучи", "ссыку", "стеклорез", "стервь", "стоячка", "струхня", "стукалка", "сукадло", "сука", "сукин", "суперсекс", "сухобзделк", "сухостойн", "сучара", "сучийпотрох", "сучийсын", "сучийхвост", "сучка", "сучьевымя", "съебывать", "съебываться", "сявка", "телка", "тибетчик", "титечка", "титька", "титя", "титястая", "толстозад", "торчило", "транда", "трандюк", "трепак", "триппер", "трихомудия", "труханина", "трухать", "трухня", "туркать", "удристать", "уеть", "усер", "усирать", "усрать", "усрачка", "уссывать", "фабать", "факать", "фаллос", "фарья", "фачить", "фачиться", "фекалий", "фекал", "фигвам", "фиг", "фигсней", "хавырка", "хамлешка", "харево", "харекришничать", "харить", "хариться", "харка", "хезальник", "хезать", "хезник", "хипа", "хитромудый", "хохотунчик", "худоебина", "хули", "хуля", "хуюшки", "целка", "целоч", "цирковать", "чернозадый", "чертыхан", "чирышек", "чичеряка", "чичиряка", "чмень", "чмызать", "чудильник", "чухан", "чушк", "чушок", "шалава", "шалашовка", "шанкр", "шахна", "шваба", "шваркнуть", "шворин", "шворить", "шворка", "шеблаебла", "шерстянаякража", "шибздик", "шкворень", "шлюх", "шмара", "шмарить", "шмондя", "шмонка", "шпили", "шпокну", "шулята", "щекотильник", "экскремент", "эрекция", "эсэс", "эшка", "эякуляция", "юлдак", "юлда", "ядрена", "ядрены", "ядри", "язви", "ялдак", "ялда", "ялдометр", "северок", "стервь", "совокупление", "шкворень", "пульвер", "выеть", "язви", "совокупиться", "мотовило", "глиномес", "фиг", "оргия", "подсердечник", "кодеш", "дойки", "сношение", "экскремент", "суперсекс", "хезник", "соитие", "щекотильник", "эрекция", "пенис", "мотылек", "помет", "кокушки", "хохотунчик", "сухостойный", "лэк", "чушок", "понос", "шалашовка", "шерстянаякража", "махалка", "растакая", "бардач", "поддавать", "падалец", "транда", "мессалина", "малофейка", "растак", "бедка", "обиженка", "маслобойщик", "подвальчик", "двуснастный", "менжеваться", "цирковать", "вафлист", "ковырялк", "мастев", "натяг", "растуды", "перещупа", "менжа", "кустотерап", "профурсет", "позитура", "крикуша", "хипа", "поматроси", "кунка", "кутак", "случка", "кнахт", "куна", "эшка", "лыха", "фаллос", "малофья", "фарья", "бублить", "тибетчи", "поскребыш" ] );	

